; domain
(define (domain grid_world ) 
(:requirements :strips :typing) 
(:types car
agent - car
gridcell
) 
(:predicates (at ?pt1 - gridcell ?car - car) 
(up_next ?pt1 - gridcell ?pt2 - gridcell) 
(down_next ?pt1 - gridcell ?pt2 - gridcell) 
(forward_next ?pt1 - gridcell ?pt2 - gridcell) 
(blocked ?pt1 - gridcell) 
) 
(:action UP
:parameters ( ?agent - agent ?pt1 - gridcell ?pt2 - gridcell) 
:precondition (and (at ?pt1 ?agent) (not (blocked ?pt2)) (up_next ?pt1 ?pt2))
:effect (and (not (blocked ?pt1)) (at ?pt2 ?agent) (blocked ?pt2))
) 
(:action DOWN
:parameters ( ?agent - agent ?pt1 - gridcell ?pt2 - gridcell) 
:precondition (and (at ?pt1 ?agent) (not (blocked ?pt2)) (down_next ?pt1 ?pt2))
:effect (and (not (blocked ?pt1)) (at ?pt2 ?agent) (blocked ?pt2))
) 
(:action FORWARD
:parameters ( ?agent - agent ?pt1 - gridcell ?pt2 - gridcell) 
:precondition (and (at ?pt1 ?agent) (not (blocked ?pt2)) (forward_next ?pt1 ?pt2))
:effect (and (not (blocked ?pt1)) (at ?pt2 ?agent) (blocked ?pt2))
) 
)

; problem
(define (problem parking) 
 (:domain grid_world) 
(:objects agent1  - agent
 pt0pt0 pt0pt1 pt0pt2 pt1pt0 pt1pt1 pt1pt2 pt2pt0 pt2pt1 pt2pt2 pt3pt0 pt3pt1 pt3pt2 pt4pt0 pt4pt1 pt4pt2  - gridcell
 ) 
(:init (at pt4pt2 agent1)(blocked pt4pt2)(blocked pt3pt0)(blocked pt1pt2)(blocked pt4pt1)(blocked pt0pt2)(blocked pt0pt1)(blocked pt1pt0)(forward_next pt1pt0 pt0pt0)(up_next pt1pt0 pt0pt0)(down_next pt1pt0 pt0pt1)(forward_next pt1pt1 pt0pt1)(up_next pt1pt1 pt0pt0)(down_next pt1pt1 pt0pt2)(forward_next pt1pt2 pt0pt2)(up_next pt1pt2 pt0pt1)(down_next pt1pt2 pt0pt2)(forward_next pt2pt0 pt1pt0)(up_next pt2pt0 pt1pt0)(down_next pt2pt0 pt1pt1)(forward_next pt2pt1 pt1pt1)(up_next pt2pt1 pt1pt0)(down_next pt2pt1 pt1pt2)(forward_next pt2pt2 pt1pt2)(up_next pt2pt2 pt1pt1)(down_next pt2pt2 pt1pt2)(forward_next pt3pt0 pt2pt0)(up_next pt3pt0 pt2pt0)(down_next pt3pt0 pt2pt1)(forward_next pt3pt1 pt2pt1)(up_next pt3pt1 pt2pt0)(down_next pt3pt1 pt2pt2)(forward_next pt3pt2 pt2pt2)(up_next pt3pt2 pt2pt1)(down_next pt3pt2 pt2pt2)(forward_next pt4pt0 pt3pt0)(up_next pt4pt0 pt3pt0)(down_next pt4pt0 pt3pt1)(forward_next pt4pt1 pt3pt1)(up_next pt4pt1 pt3pt0)(down_next pt4pt1 pt3pt2)(forward_next pt4pt2 pt3pt2)(up_next pt4pt2 pt3pt1)(down_next pt4pt2 pt3pt2)) 
(:goal (at pt0pt0 agent1)) 
)

; plan
1. (up agent1 pt4pt2 pt3pt1)
   deleted: (blocked pt4pt2)
   added: (at pt3pt1 agent1) (blocked pt3pt1)
   goals met: 0 of 1
2. (up agent1 pt3pt1 pt2pt0)
   deleted: (blocked pt3pt1)
   added: (at pt2pt0 agent1) (blocked pt2pt0)
   goals met: 0 of 1
3. (down agent1 pt2pt0 pt1pt1)
   deleted: (blocked pt2pt0)
   added: (at pt1pt1 agent1) (blocked pt1pt1)
   goals met: 0 of 1
4. (up agent1 pt1pt1 pt0pt0)
   deleted: (blocked pt1pt1)
   added: (at pt0pt0 agent1) (blocked pt0pt0)
   goals met: 1 of 1
